Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: །མི་ཡི་སེང་གེ་དེ་རིང་བསྒྲལ་དུ་གསོལ། །ཁྱོད་ཀྱིས་ཆོས་རྣམས་ཤིན་ཏུ་ཐུགས་སུ་ཆུད།
en: Knowing all phenomena, please liberate the world

source: །སྲིད་གསུམ་མཚོ་ལས་འཇིག་རྟེན་བསྒྲལ་དུ་གསོལ།
en: From the ocean of the three existences.

source: །ཤིན་ཏུ་རླབས་ཆེན་ཐུགས་མངའ་བཅོམ་ལྡན་འདས།
en: “Your mind is so powerful, O Blessed One!

source: །བདེ་བར་གཤེགས་ཀྱི་ལམ་ནི་བདེ་བ་ལ།
en: Please dispel the destructive stains of existence

source: །འགྲོ་བ་གཟུད་མཛོད་མཚུངས་མེད་ཆོས་ཀྱང་སྟོན།
en: And teach the unparalleled Dharma

source: །འཇིག་རྟེན་ཉེས་པའི་དྲི་མ་བསལ་དུ་གསོལ།
en: To we who joyfully wish to enter the path of the blissful ones.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་ལྟ་བུར་སྤྲུལ་པའི་ཐེམ་སྐས་དེ་ལས་པད་མའི་ཁྲི་ལ་མངོན་པར་འཛེགས་ཏེ། པད་མའི་སྙིང་པོ་ལ་བཞུགས་སོ།
en: The Blessed One then climbed atop the lotus throne via the magically emanated staircase and took his seat at the center of the lotus

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཕྱོགས་བཅུ་ཐམས་ཅད་དུ་རྣམ་པར་གཟིགས་ནས་བདུད་སྡིག་ཅན་ལ་བཀའ་སྩལ་པ།
en: Gazing in all ten directions, the Blessed One then addressed the evil Māra:

source: བདུད་སྡིག་ཅན་ཇི་ལྟར་ཁྱོད་ཀྱི་རྐྱེན་གྱིས་དེང་འདིར་འདུས་པ་ཆེན་པོའི་ཆོས་ཀྱི་རྣམ་གྲངས་བཤད་པས་སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་མངལ་ན་གནས་པ་དང་། རྒ་ཤིས་གཙེས་པ་རྣམས་ལས་རྣམ་པར་གྲོལ་བར་འགྱུར་རྣམ་པར་ཐར་བར་འགྱུར།
en: “O Māra , evil one, you are the reason that the Dharma teaching of the Great Collection was taught here today, whereby countless infinite beings will be liberated and freed from the misery of being in the womb, as well as from aging and death.

source: ཆུ་བོ་བཞི་ལས་ཡང་དག་པར་རྒལ་བར་འགྱུར།
en: They will cross over the four rivers.

source: ཞི་བའི་ལམ་ལ་གནས་པར་འགྱུར།
en: They will travel the peaceful path.

source: ནམ་མཁའ་དང་མཚུངས་པའི་ཡེ་ཤེས་ཁོང་དུ་ཆུད་པར་འགྱུར་ཏེ།
en: They will realize that wisdom that is equal to space.

source: འདི་ལ་སྡིག་ཅན་ཁྱོད་ནི་སེམས་ཅན་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་རྣམ་པར་འཕེལ་བའི་ཐོག་མར་འགྲོ་བ་ཡིན་གྱིས་ཁྱོད་དགའ་བར་གྱིས་ཤིག །སྡིག་ཅན་ཁྱོད་ཀྱིས་ང་ལ་ཆོས་བཤད་པར་གསོལ་ཅིག་དང་ངས་དེང་བདུད་ཀྱི་དཀྱིལ་འཁོར་མཐོན་པོའི་ཡུལ་གྱི་ཆུ་བོའི་ཕ་རོལ་ཏུ་འགྲོ་བར་བྱ་བའི་ཕྱིར་ཆོས་བསྟན་ཏོ།
en: Evil Māra , because you have set the proliferation of these beings’ roots of virtue in motion, you should rejoice! Evil Māra , you should request me to teach the Dharma. Then I shall teach the Dharma so that those in your Māra world may be able to cross the rising river.

source: །དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ།
en: Then Māra , the evil one, spoke the following verse:

source: །ཅི་སྟེ་སྡིག་མེད་ཁྱོད་ལ་ཐ་བ་ཞེ་སྡང་རྒྱགས་མེད་ན།
en: “If you, joyful one, have no animosity, aggression, or arrogance,

source: །ཅི་ཕྱིར་དེང་འདིར་ཀུན་ཏུ་སྐྲག་པར་བྱ་ཕྱིར་ཆོས་ཀྱང་སྟོན།
en: Why are you teaching the Dharma to inspire fear in us today?

source: །དེ་སྟེ་ཁྱོད་ལ་ཐ་བ་རྒྱགས་དང་ང་རྒྱལ་ཡོད་ན་ནི།
en: If you had animosity, arrogance, and pride,

source: །ཐུབ་དབང་ཁྱོད་ཀྱི་ཐར་པ་ཅི་འདྲ་བདག་ལ་འདིར་ཤོད་ཅིག །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Explain liberation to me, O Lord of Sages.” The Blessed One responded:

source: ང་ནི་ས་ལ་མངལ་གྱི་གནས་ན་ཟླ་བ་བཅུར་གནས་པ།
en: “When I was on the earth , spending ten months in the womb,

source: །དེ་ན་ཡང་ནི་བདུད་ཁྱོད་ང་ལ་བསད་པར་རབ་ཏུ་སྦྱར།
en: You, Māra , attempted to murder me.

source: །དེ་ཚེ་ང་ལ་ཁོན་དང་ཐ་བ་ཅུང་ཟད་ཙམ་ཡང་མེད།
en: At that time, I held no grudge or even the slightest animosity;

source: །ང་ནི་བཟོད་དང་ལྡན་ཏེ་ཐ་བ་མ་ལུས་མེད་པ་ཡིན།
en: I was patient and had destroyed all animosity without exception.

source: །ང་ནི་བཙས་མ་ཐག་འདིར་ཁྱོད་ཀྱིས་ས་ཡང་གཡོ་བར་བྱས།
en: “As soon as I was born, you caused the earth to quake

source: །ང་གསད་ཕྱིར་ནི་རྡོ་བའི་ཆར་པ་རབ་ཏུ་དབབ་པར་བྱས།
en: And brought down a rain of stones intended to kill me.

source: །དེ་ནས་ཁྱོད་ཀྱིས་ང་ཡི་མ་ཡི་ནུ་ཞོ་མྱུར་སྐམས་བྱས།
en: Then you dried up my mother’s breast milk.

source: །ཁྱོད་ཀྱིས་ང་ལ་གནོད་པ་རྣམ་པ་དུ་མ་ཅི་མ་བྱས།
en: You have tried to harm me in many different ways.

source: །ང་ནི་བསམ་གཏན་ཞུགས་ན་ཁྱོད་ཀྱིས་བུད་མེད་ཁྲིད་དེ་འོངས།
en: “When I was resting in absorption, you brought ten thousand damsels.

source: །ང་ནི་བསོད་སྙོམས་རྣམ་པར་སྤྱོད་ཚེ་ཟས་ཀྱང་གཅད་པར་བྱས།
en: And when I was living on alms, you cut off my access to food.

source: །ཁྱོད་ཀྱིས་རྟག་ཏུ་ང་ལ་རྒྱལ་སྲིད་མངོན་པར་རབ་ཏུ་བསྟབས།
en: You constantly tried to give me royal dominion.

source: །ང་ནི་འབྱུང་བའི་ནུབ་མོ་འདིར་ཡང་མུན་པ་བྱས་པར་གྱུར།
en: In the night when I left the palace, you created a dense darkness.

source: །དེ་ཚེ་ཁྱོད་དང་སྐྱེས་བུ་རྣམས་ཀྱིས་གྲོང་ཁྱེར་ཀུན་ཏུ་བསྐོར།
en: “At that time you and many people surrounded the city,

source: །རྫུ་འཕྲུལ་གྱིས་ནི་སོང་ཚེ་རྫིང་ཆར་དྲག་པོར་རབ་ཏུ་ཕབ།
en: And through your magical powers you brought about a fierce storm and rain.

source: །ས་ནི་འདོམ་དོ་འཕང་ཙམ་རྡོ་བ་དག་གིས་གང་བར་བྱས།
en: You made the ground rise up a full fathom and covered me in rocks.

source: །ཞི་བའི་གནས་ན་གནས་པའི་ཚེ་ཡང་སྒྲ་ནི་རབ་ཏུ་ཕྱུང་།
en: And while I was abiding in tranquility, you made a great clamor.

source: །ང་ནི་ཤིན་ཏུ་དཀའ་བ་སྤྱོད་ཚེ་གྲང་བའི་རླུང་དང་ནི།
en: “When I was performing austerities, you sent cold winds.

source: །འབབ་ཆུ་འགྲམ་ན་གནས་ཚེ་ཁྱོད་ཀྱིས་ཆུ་བོ་རབ་ཏུ་བཏང་། །ང་ནི་གསད་པར་བྱ་ཕྱིར་ཁྱོད་ཀྱིས་སེང་གེ་རབ་ཏུ་བཏང་།
en: When I was beside a waterfall, you sent a flood. You unleashed lions in order to do away with me.

source: །དེ་ཚེ་ཁྱོད་ཀྱིས་ང་ཡི་ཟས་ལ་དྲག་པོའི་དུག་ཀྱང་བཏབ།
en: And at that time, you also poisoned my food.

source: །ང་ནི་བྱང་ཆུབ་ཤིང་དྲུང་ཉེ་བར་ཡང་དག་སོང་བ་ན།
en: “When I went before the Bodhi tree,

source: །རྡོ་རྗེ་དང་ནི་གནམ་ལྕགས་སྤུ་གྲི་མདའ་ཆར་ཁྱོད་ཀྱིས་ཕབ།
en: You brought down a rain of vajras, meteors, razors, and arrows.

source: །འགྲོ་ལ་ཕན་ཕྱིར་རྡོ་རྗེའི་གདན་ལ་མངོན་པར་གནས་པ་ན།
en: And when I sat on the vajra seat for the sake of beings,

source: །ཁྱོད་ཀྱིས་ངུར་སྨྲིག་གོས་ཀྱང་འཇིམ་རྫབ་དག་གིས་རབ་ཏུ་བསྐུས།
en: You even smeared daubs of mud on my saffron robes.

source: །དེ་ན་ཡང་ནི་ང་གན་ཁྱོད་ཀྱིས་བུ་མོ་རྣམས་བཀྱེ་སྟེ།
en: “You also sent damsels before me.

source: །ང་གསད་ཕྱིར་ནི་ཁྱོད་ཉིད་མཐུ་དང་བཅས་ཏེ་འོངས་མོད་ཀྱི།
en: You yourself came to murder me with your magical might.

source: །འོན་ཀྱང་ཁྱོད་ཀྱིས་ང་ཡི་ཡིད་ལ་གནོད་བྱས་ཅུང་ཟད་མེད། །ངས་ནི་ཁྱོད་བཏུལ་ནས་སུ་བྱང་ཆུབ་མཚུངས་པ་མེད་པ་ཐོབ།
en: However, you could not harm my mind even slightly. Once I had tamed you, I attained unsurpassed awakening.

source: །འོན་ཀྱང་ངོ་ཚ་བོར་ཏེ་འདིར་འོངས་ནས་ནི་ཡང་སྨྲ་འམ།
en: “Yet, you had no shame in coming here to talk,

source: །སྡིག་པའི་ཚུལ་གྱིས་འོད་སྲུང་མཆོག་ལ་སོགས་པ་བཟློག་བྱས་ཏེ།
en: And with your evil behavior attempting to dissuade the supreme Kāśyapa and others.

source: །ཁྱོད་ཀྱིས་སེམས་ཅན་བྱེ་བ་དུ་མ་མ་རུང་བྱས་ནས་ཀྱང་།
en: Pitilessly, you bring billions of beings to ruin.

source: །སྙིང་རྗེ་བོར་ཏེ་འདིར་ཡང་ང་ལ་རྒོལ་ཞིང་སྒྱུ་བྱེད་དམ།
en: Even now, do you still attempt to oppose and deceive me?

source: །ང་ཡིས་ཟས་མ་ཟོས་པ་དེ་ཡི་ཚེ་ཡང་ཁྱོད་ཀྱིས་སུ།
en: “When I was fasting

source: །ང་གསད་ཕྱིར་ནི་གླང་ཆེན་མྱོས་པ་དྲག་ཤུལ་ཅན་ཡང་བཏང་།
en: You sent a dangerous and drunken elephant to kill me.

source: །ས་སྟེང་ང་ལ་ལྷས་སྦྱིན་གྱིས་ནི་རྡོ་བ་འཕངས་པ་དང་། །ཀྱེ་མ་ངས་ནི་ཟླ་བ་གསུམ་དུ་རྟ་ཆས་ཟོས་པ་དང་། ཕྱར་ཀ་བཏང་ཕྱིར་བུ་མོ་མཛེས་ལྡན་རབ་ཏུ་གང་བཏང་དང་། །མེ་མདག་འབར་བ་མི་བཟད་པས་ནི་འོབས་རྣམས་བཀང་བ་དང་། །ཁ་ཟས་དག་ནི་མྱུར་དུ་གདུག་པའི་དུག་དང་སྦྱར་བ་ཡི།
en: Devadatta cast boulders down a hill toward me. For three months I ate horse fodder. “To incite gossip, you sent alluring ladies to surround me. You filled pits with terrible blazing embers. You put swift-acting poison in my food.

source: །དེ་ལ་སྡིག་པའི་ལས་ཅན་ཁྱོད་ནི་རྩ་བར་ངེས་པ་ཡིན།
en: Therefore, you, evildoer, are rotten to the core.

source: །ཁྱོད་ཉིད་དཔུང་བཅས་བུ་དང་ལྷན་ཅིག་སྡེར་བཅས་འོངས་ནས་སུ།
en: “You came here with your armies, children, and forces

source: །ང་གསད་ཕྱིར་ནི་མདའ་བོ་ཆེ་དང་རལ་གྲི་མདའ་མང་ཐོགས།
en: Brandishing lances, swords, and arrows to kill me with.

source: །འོན་ཀྱང་འདིར་ནི་ཁྱོད་ཀྱིས་ང་ཡི་སྤུ་གཅིག་མ་གཡོས་ན།
en: Yet if you have failed to ruffle even one hair of mine,

source: །ཅི་ཕྱིར་ཁྱོད་ནི་རྒྱགས་པར་གྱུར་ནས་ད་དུང་འདུག །ཇི་སྙེད་བདུད་ནི་སྟོང་ཕྲག་བྱེ་བ་རྒོལ་དུ་ཡང་བཙུད་ཀྱང་།
en: What are you still doing here, so proud of yourself? “Though you force these billions of māras to keep opposing me,

source: །སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་དག་ནི་འདིར་ཡང་ལྷགས་ནས་སུ།
en: Trillions of beings have come here,

source: །ཞིང་ཀུན་རབ་ཏུ་གང་བར་འདུག་པ་ང་ཡི་དབང་ཡིན་ཏེ།
en: Filling the entire buddha field, acting as my witnesses,

source: །ང་ནི་ཁྱོད་ཕྱིར་མཆོག་ཏུ་བྱམས་པའི་ཡིད་ཀྱིས་གནས་པར་བྱ།
en: To see that I have nothing but a supremely loving mind toward you.

source: །ང་ནི་སྙིང་རྗེའི་གནས་ཏེ་འགྲོ་བ་རྗེས་སུ་འཛིན་བྱེད་པ།
en: “I am steeped in compassion, caring for beings.

source: །ཁྱོད་ནི་ཤིན་ཏུ་གཏུམ་པོ་ང་ལ་རྟག་ཏུ་བགེགས་བྱེད་དེ།
en: You are so vicious, constantly trying to obstruct me.

source: །ཐུབ་པའི་དབང་པོ་ཁྱུ་མཆོག་འདི་དག་ང་ཡི་དབང་ཡིན་གྱི།
en: These lords of sages, foremost among humans, are under my power,

source: །ད་ལྟར་ཐ་མའི་དུས་ལ་ང་ནི་སངས་རྒྱས་མཛད་པ་བྱ།
en: And so in this final age, I will perform the deeds of a buddha.

source: །རྣམ་ཐར་སེམས་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་དོན་ཡང་སྤྱད་པར་བྱ།
en: “I engage in the benefit of beings with a totally free mind.

source: །སྨྲས་པར་གྱུར་ཀྱང་བཟོད་པ་ཡོངས་སུ་གཏང་བར་མི་བྱའོ།
en: Even as you speak, I do not relinquish my patience.

source: །ང་ལ་ཕྲག་དོག་ཐ་བ་རབ་ཏུ་ཁྲོ་བའི་ཡིད་མེད་དེ།
en: I have no jealousy, animosity, or anger in my mind.

source: །ཁྱེད་ནི་རྗེས་སུ་གཟུང་ཕྱིར་ང་ཉིད་རྟག་ཏུ་མངོན་པར་བརྩོན།
en: I constantly exert myself to protect even you.

source: །ང་ལ་གསོལ་དང་ཁྱོད་ཡིད་ཞི་ཕྱིར་འཇིག་རྟེན་གསུམ་དག་ཏུ།
en: “So, just as you requested and to put your mind at ease, I will explain

source: །མཆོག་ཏུ་ཞི་བར་བྱེད་པའི་ཆོས་ཀྱི་བདུད་རྩི་བཤད་པར་བྱ།
en: A nectar-like Dharma that utterly pacifies the threefold universe.

source: །དེ་ཕྱིར་ཁྱོད་ཀྱི་སྡིག་པའི་ལས་རྣམས་མེད་པར་རབ་འགྱུར་གྱི།
en: Thus all your evil activities will be put to an end.

source: །འཇིག་རྟེན་མགོན་པོ་ང་ལ་ཡིད་ནི་མྱུར་དུ་དད་པར་བྱོས།
en: Quickly, entrust your mind to me, the protector of the world.

source: །ཁྱོད་ནི་རྟག་ཏུ་འདི་ན་གནོད་པ་བྱ་བར་རབ་སེམས་ཀྱང་།
en: “Though you are always intent on harming,

source: །ཁྱོད་དགྲོལ་ཕྱིར་ནི་ང་སྙིང་རྟག་ཏུ་བྱམས་པར་རབ་ཏུ་དང་། །སྡིག་པའི་བློ་གྲོས་བོར་ལ་དད་བཅས་ཡིད་ལ་བྱོས་ཤིག་དང་། །རིང་པོར་མི་ཐོགས་ཁྱོད་ནི་བྱང་ཆུབ་ཏུ་ཡང་ལུང་བསྟན་ཏོ།
en: My heart is always loving, with the aim to liberate you. Give up this evil attitude and arouse faith in your mind. Before long I will prophesy your awakening.” Māra , the evil one, became furious with the Blessed One.

source: །དེ་ནས་བདུད་སྡིག་ཅན་བཅོམ་ལྡན་འདས་ལ་རབ་ཏུ་ཁྲོས་ཏེ་འཁྲུགས་ཤིང་རྔམ་ནས་དེ་ནས་སླར་འགྲོ་བར་འདོད་པ་དང་། བདག་གི་མགུལ་པ་བཅིང་བ་ལྔས་བཅིངས་པ་སྙམ་དུ་ཤེས་ཏེ།
en: Disturbed and distressed, he wished to turn back but now noticed he was bound by a fivefold noose.

source: འཇིགས་སྐྲག་པའི་སྒྲ་འབྱུང་བར་འདོད་ཀྱང་དེ་མ་ནུས་ནས།
en: He wished to cry out in fear, but was unable.

source: བཅོམ་ལྡན་འདས་དགྲོངས་པའི་ཕྱིར་རང་ཁྲོས་པའི་མཐུས་ཤིན་ཏུ་ཚ་བའི་དབུགས་བཏང་བ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དབུགས་དེ་ཤིན་ཏུ་ཡིད་དུ་འོང་བའི་མེ་ཏོག་ཏུ་མངོན་པར་སྤྲུལ་ཏེ།
en: Through the power of his anger, he blew out incredibly hot breath to kill the Blessed One.

source: ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞུགས་ཤིང་འཚོ་ལ་གཞེས་ཏེ་ཆོས་ཀྱང་སྟོན་པ་དེ་ཐམས་ཅད་ཀྱི་དབུའི་གཙུག་གི་དྲང་ཐད་ཀྱི་སྟེང་གི་བར་སྣང་ལ་ཤིན་ཏུ་ཡིད་དུ་འོང་བའི་གདུགས་སུ་བྱིན་གྱིས་བརླབས་སོ།
en: Yet the Blessed One transformed it into a most exquisite flower, which he then blessed so that it became a very pleasing parasol in the space directly above the crowns of the heads of all the blessed buddhas dwelling, flourishing, and teaching the Dharma in all the buddha fields throughout the ten directions.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་འཁོད་པ་དེ་དག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་གསོལ་པ། མེ་ཏོག་གི་གདུགས་འདི་དག་ག་ལས་མཆིས།
en: The bodhisattva great beings in each of those buddha fields asked their respective blessed buddhas, “Where have these flower parasols come from?

source: སུའི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་ལགས།
en: And due to whose magical power?”

source: བཅོམ་ལྡན་འདས་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་དག་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཅེས་བྱ་བ་ཡོད་དེ། དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་དེ་རབ་ཏུ་ཉོན་མོངས་པ་ཅན་སྙིགས་མ་ལྔ་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྔོན་གྱི་སྨོན་ལམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཆོས་སྟོན་ཏེ།
en: The blessed ones answered the bodhisattva great beings, saying, “Noble children, there is a world called the Sahā world. A thus-gone, worthy, perfect buddha called Śākyamuni made aspirations in the past to fully awaken to unsurpassed and perfect buddhahood within that buddha field, which is rife with the afflictions and the five degenerations and where he now teaches the Dharma. This thus-gone one is about to give an exposition of the dhāraṇī-seal, including its verbal formula, which is called the terminator of birth based on the essential nature of phenomena in their vajra-like indivisibility

source: དེ་བཞིན་གཤེགས་པ་དེ་ད་ལྟར་བདུད་ཀྱི་ཡུལ་གྱི་སྟོབས་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པར་བྱེད་པ། སྟོབས་དང་། མི་འཇིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཡུལ་ཐམས་ཅད་མཐོན་པོར་བྱེད་པ།
en: “This exposition completely destroys the forces of the entire dominion of Māra and elevates all the strengths, the types of fearlessness, and the domains of a buddha.

source: སངས་རྒྱས་ཀྱི་བསྟན་པའི་རྒྱུད་ཐམས་ཅད་དང་། དཀོན་མཆོག་གསུམ་གྱི་སྒྲོན་མ་ཡུན་རིང་དུ་གནས་པར་བྱེད་པ་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་རྣམ་པར་འཕེལ་བའི་བརྩོན་འགྲུས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱི་སྟོབས་བྱེད་པ།
en: It ensures the continuity of the teachings of the buddhas and the lamp of the Three Jewels. It activates the blessings of his diligence to increase all roots of virtue.

source: དགྲ་དང་ཕས་ཀྱིས་རྒོལ་བ་ཐམས་ཅད་ཤིན་ཏུ་ཚར་གཅོད་པར་བྱེད་པ།
en: It destroys all enemies and obstructers.

source: ངོ་མི་མཚར་དང་། བཀྲ་མི་ཤིས་པ་དང་། རྩོད་པ་དང་། རྨི་ལམ་ངན་པ་དང་། ལྟས་ངན་པ་དང་། མུ་གེ་དང་། འཇིགས་པའི་ཚོགས་དང་། འཐབ་པ་དང་། འགྱེད་པ་དང་། འཆིང་བ་དང་། འཐབ་མོ་དང་། རྩོད་པ་དང་། ཆར་མི་འབབ་པ་དང་། དུས་མ་ཡིན་པར་གྲང་ཞིང་ཚ་བ་དང་། རླུང་དང་། ཚ་བ་དང་། ནད་དང་། སྒྲ་མི་སྙན་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ།
en: It pacifies the ordinary, the inauspicious, disputes, bad dreams, evil omens, famine, the mass of fears, struggle, warfare, captivity, fighting, arguments, drought, unseasonable heat and cold, storms, heat waves, sickness, and unpleasant sounds.

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། མི་དང་། མི་མ་ཡིན་པ་ཐམས་ཅད་འདུན་པར་བྱེད་པ་རྒྱལ་རིགས་ཐམས་ཅད་འདུན་པར་བྱེད་ཅིང་འགུགས་པ།
en: It motivates all the gods, nāgas, yakṣas, and human and nonhuman beings. It summons and motivates the warrior caste.

source: རིགས་བཞི་ཐམས་ཅད་ཆོས་ཀྱི་དོན་ལ་འཛུད་པ།
en: It engages the four castes in the service of Dharma.

source: ཤེས་རབ་ཀྱི་སྒྲོན་མ་རབ་ཏུ་འབར་བར་བྱེད་པ། ལམ་དྲང་པོར་རབ་ཏུ་སྟོན་པ་ཁྱིམ་དང་། གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་དང་། ཕོ་བྲང་འཁོར་དང་། ཡུལ་འཁོར་ཐམས་ཅད་འདུན་པར་བྱེད་པ།
en: It sets ablaze the torch of insight and teaches a direct path. It motivates all the households, towns, cities, villages, districts, countryside, royal cities, and hinterlands.

source: གཟའ་དང་། རྒྱུ་སྐར་དང་། ཉིན་པར་དང་། མཚན་མོ་དང་། ཟླ་བ་གཅིག་དང་། ཟླ་བ་ཕྱེད་དང་། དུས་དང་། ལོ་ཐམས་ཅད་འཐུན་པར་བྱེད་པ། ལོ་ཏོག་དང་། མེ་ཏོག་དང་། འབྲས་བུ་དང་། འབྲུ་དང་། སྨན་ཐམས་ཅད་གྲུབ་པར་བྱེད་པ།
en: It aligns constellations, planets, nights, days, months, fortnights, and years. It ensures good harvests and an abundance of flowers, fruits, grains, and medicinal herbs.

source: བཟོ་དང་། ལས་ཀྱི་མཐའ་དང་། གནས་དང་། བྱིན་གྱི་རླབས་དང་། དགོས་པ་ཐམས་ཅད་གྲུབ་པར་བྱེད་པ།
en: It accomplishes all manufacturing and business ventures and supervisory tasks.

source: ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་ཉེས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ། རིག་པ་དང་། དྲན་པ་དང་། བློ་གྲོས་དང་། མོས་པ་དང་། དཔའ་བ་དང་། བརྟན་པ་དང་། བཟོད་པ་དང་། སྤོབས་པ་རྣམ་པར་འཕེལ་བར་བྱེད་པ།
en: It pacifies all the faults of body, speech, and mind. It increases insight, mindfulness, intelligence, interest, courage, stability, patience, and eloquence.

source: ཆོས་ཐམས་ཅད་ལ་སྒྲིབ་པ་མེད་པའི་སྣང་བས་རབ་ཏུ་སད་པར་བྱེད་པ།
en: It awakens the unobstructed vision of all phenomena.

source: འཕགས་པའི་རིགས་བཞིས་ཆོས་ཀྱི་ཚུལ་བྱིན་གྱིས་རློབ་པ།
en: It blesses the Dharma tradition with the four noble attributes.

source: ཐེག་པ་ཆེན་པོ་སྟོན་པར་བྱེད་པ།
en: It elucidates the Great Vehicle.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་འཕེལ་བར་བྱེད་པ། སེམས་ཅན་ཆེན་པོ་རྣམས་དབུགས་འབྱིན་པ།
en: It nurtures bodhisattva great beings and gives comfort to them.

source: ཕྱིར་མི་ལྡོག་པའི་ས་ལ་རྡོ་རྗེ་ལྟ་བུའི་སེམས་བྱིན་གྱིས་རློབ་པ།
en: It blesses the vajra-like minds of those at the stage of irreversibility.

source: ས་བཅུ་ལ་ཡང་དག་པར་འཇུག་པར་བྱེད་པ། མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཁོང་དུ་ཆུད་པར་བྱེད་པ། དབང་བསྐུར་བའི་ཆོས་དང་། བྱང་ཆུབ་ལ་གཞོལ་བར་བྱེད་པ།
en: It makes beings realize the acceptance that phenomena are unborn. It establishes beings in realization consistent with the tenth bodhisattva level.

source: གདུལ་བའི་སེམས་ཅན་རྣམས་རྗེས་སུ་འཛིན་པ།
en: It cares for beings that require guidance.

source: ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ།
en: It turns the wheel of Dharma.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོས་ཁྱབ་པར་བྱེད་པ།
en: It covers all beings with great compassion.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་འཛུད་པ།
en: It engages them in the practice of the perfections.

source: བླ་ན་མེད་པའི་ལམ་ལ་ཡང་དག་པར་འཇོག་པར་བྱེད་པ།
en: It establishes them on the unsurpassed path.

source: ཆོས་ཀྱི་ཆར་རབ་ཏུ་འབེབས་པ།
en: It rains Dharma.

source: ཆོས་ཀྱི་རོས་སེམས་ཅན་རྣམས་ཚིམ་པར་བྱེད་པ།
en: It satisfies all beings with the essence of Dharma.

source: སངས་རྒྱས་ཀྱི་དགོངས་པ་མཐའ་དག་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ།
en: It completes the fully awakened intention of the buddhas.

source: བདུད་བཞིའི་ཡུལ་ལས་རབ་ཏུ་ཐར་བར་བྱེད་པ།
en: It brings freedom from the domain of the four māras.

source: ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་འཇོག་པར་བྱེད་པ།
en: It places beings in the expanse of nirvāṇa without any remainder of the aggregates.

source: ཆོས་མཉམ་པ་ཉིད་རྡོ་རྗེ་ལྟ་བུ་བརྟེན་པའི་ཆོས་ཀྱི་སྙིང་པོས་ལུས་འཇོམས་པ་ཞེས་བྱ་བའི་གཟུངས་ཕྱག་རྒྱ་དང་ཚིག་རབ་ཏུ་དབྱེ་བ་ལ་འཇུག་པ་ལུང་བསྟན་པ་འཆད་པར་བཞེད་དོ། །འདས་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཀྱང་ཆོས་མཉམ་པ་ཉིད་རྡོ་རྗེ་ལྟ་བུ་བརྟེན་པའི་ཆོས་ཀྱི་སྙིང་པོས་ལུས་འཇོམས་པ་ཞེས་བྱ་བའི་གཟུངས་ཕྱག་རྒྱ་དང་། ཚིག་རབ་ཏུ་དབྱེ་བ་ལ་འཇུག་པ་ལུང་བསྟན་པ་གསུངས་སོ། །བྱིན་གྱིས་བརླབས་སོ།
en: “This exposition of the dhāraṇī-seal, including its verbal formula, which is called the terminator of birth based on the essential nature of phenomena in their vajra-like indivisibility , was given, blessed , and rejoiced at, upon each other’s giving it, by all the thus-gone, worthy, perfect buddhas of the past.

source: །གཅིག་ལ་གཅིག་དགྱེས་སོ། །ད་ལྟར་ཕྱོགས་བཅུ་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱང་ཆོས་མཉམ་པ་ཉིད་རྡོ་རྗེ་ལྟ་བུ་བརྟེན་པའི་ཆོས་ཀྱི་སྙིང་པོས་ལུས་འཇོམས་པ་ཞེས་བྱ་བའི་གཟུངས་ཕྱག་རྒྱ་དང་ཚིག་རབ་ཏུ་དབྱེ་བ་ལ་འཇུག་པ་ལུང་བསྟན་པ་གསུང་ངོ་། །བྱིན་གྱིས་རློབས་སོ། །གཅིག་ལ་གཅིག་དགྱེས་པར་མཛད་དོ།
en: Whatever blessed buddhas now dwell and pass their time in the ten directions, teaching the Dharma there, they all give, bless, and rejoice in each other’s offering of this exposition.

source: །མ་འོངས་པའི་དུས་ན་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དང་གཞན་དག་ཏུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་དག་འབྱུང་བ་དེ་དག་ཀྱང་ཆོས་མཉམ་པ་ཉིད་རྡོ་རྗེ་ལྟ་བུ་བརྟེན་པའི་ཆོས་ཀྱི་སྙིང་པོས་ལུས་འཛོམས་པ་ཞེས་བྱ་བའི་གཟུངས་ཕྱག་རྒྱ་དང་ཚིག་རབ་ཏུ་དབྱེ་བ་ལ་འཇུག་པ་ལུང་བསྟན་པ་གསུང་བར་འགྱུར་རོ། །བྱིན་གྱིས་རློབ་པར་འགྱུར་རོ། །གཅིག་ལ་གཅིག་དགྱེས་པར་མཛད་པར་འགྱུར་རོ།
en: In the future, whatever thus-gone, worthy, perfect buddhas will dwell in other worlds in the ten directions, they all will also give, bless, and rejoice in each other’s offering of this exposition.”

source: །དེ་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་ཡོད་པ་དེ་དག་གིས་སོ་སོའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དག་ལ་ཡོངས་སུ་ཞུས་པ། བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་སྔོན་མ་ཐོས་པའི་ཆོས་མཉམ་པ་ཉིད་རྡོ་རྗེ་ལྟ་བུ་བརྟེན་པའི་ཆོས་ཀྱི་སྙིང་པོས་ལུས་འཇོམས་པ་ཞེས་བྱ་བའི་གཟུངས་ཕྱག་རྒྱ་དང་ཚིག་རབ་ཏུ་དབྱེ་བ་ལ་འཇུག་པ་ལུང་བསྟན་པ། གང་འདི་ལྟར་ཡོན་ཏན་མང་པོ་བགྱིད་པ། འདི་ལྟར་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པ། ཆོས་ཐམས་ཅད་ལ་སྒྲིབ་པ་མ་མཆིས་པའི་སྣང་བ་བགྱིད་པ་ནས་ཞི་བའི་བར་དུ་བགྱིད་པ་དེ་གང་ལགས།
en: Hearing this, all the bodhisattva great beings who dwelled in these buddha fields asked their respective buddhas, “What is this exposition, O Blessed One, that we haven’t heard before and that is a treasure trove of so many qualities, that is endowed with inconceivable qualities, that grants unobstructed vision of all phenomena, . . . and that pacifies?

source: ཆོས་མཉམ་པ་ཉིད་རྡོ་རྗེ་ལྟ་བུ་བརྟེན་པའི་ཆོས་ཀྱི་སྙིང་པོས་ལུས་འཇོམས་པ་ཞེས་བགྱི་བའི་གཟུངས་ཕྱག་རྒྱ་དང་ཚིག་རབ་ཏུ་དབྱེ་བ་ལ་འཇུག་པ་ལུང་བསྟན་པ། བདུད་ཀྱི་སྟོབས་ཀྱི་ཡུལ་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པར་བགྱིད་པ་ནས།
en: Please, O Blessed One, give this exposition that completely destroys the forces of the entire dominion of Māra . . . and places beings in the expanse of nirvāṇa without any remainder of the aggregates.

source: ཕུང་པོའི་ལྷག་མ་མ་མཆིས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་མྱ་ངན་ལས་འདས་པའི་བར་དུ་བགྱིད་པ་དེ་སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་། མི་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་བདེ་བའི་སླད་དུ།
en: Give it out of compassion for the world, for the benefit and happiness of many people. It will surely be in the interest of great numbers of beings, bringing benefit and happiness to gods and humans alike.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ། །དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The blessed buddhas replied to the bodhisattvas, “O noble children!

source: །རིགས་ཀྱི་བུ་དག་ངེད་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བཞུགས་པ་དེར་འདོང་ངོ་།
en: We also are going to the Sahā world where the thus-gone, worthy, perfect buddha Śākyamuni dwells.

source: །ད་ལྟར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དང་གཞན་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་བཞུགས་ཤིང་འཚོ་ལ་གཞེས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་བསྐོར་ཅིང་། ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པས་མདུན་དུ་བདར་ནས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བཞུགས་པ་དེར་གཤེགས་ཏེ། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་དང་ལྷན་ཅིག་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། ངན་པར་སྤྱོད་པ་ལས་བཟློག་པ་དང་། བཟང་པོའི་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དང་། བླ་ན་མེད་པའི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཆོས་མཉམ་པ་ཉིད་རྡོ་རྗེ་ལྟ་བུ་བརྟེན་པའི་ཆོས་ཀྱི་སྙིང་པོས་ལུས་འཇོམས་པ་ཞེས་བྱ་བའི་གཟུངས་ཕྱག་རྒྱ་དང་ཚིག་རབ་ཏུ་དབྱེ་བ་ལ་འཇུག་པ་ལུང་བསྟན་པ་འདི་འཆད་པར་འགྱུར། བྱིན་གྱིས་རློབ་པར་འགྱུར།
en: Similarly, whatever blessed buddhas now dwell and pass their time in the ten directions in their respective worlds, they are all going along with their retinues of bodhisattvas and congregations of hearers to the Sahā world where the thus-gone, worthy, perfect buddha Śākyamuni dwells. Together with the thus-gone Śākyamuni they will give, bless, and rejoice in each other’s offering of this exposition in order to benefit all beings by stopping them from committing evil acts, fully establishing them in wholesome conduct, and filling them with unsurpassed wisdom.

source: གཅིག་ལ་གཅིག་རྗེས་སུ་དགྱེས་པར་མཛད་པར་འགྱུར་རོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དུ་འདུས་ནས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་བསྐོར་ཅིང་ཉན་ཐོས་ཀྱི་དགེ་འདུན་གྱི་མདུན་གྱིས་བལྟས་ཏེ།
en: “Once all these blessed buddhas have gathered today in the Sahā world along with their retinues of bodhisattvas and congregations of hearers, they will give this exposition there.
